In [39]:
import pandas as pd

In [40]:
df = pd.read_csv("data/weather_data.csv")

In [41]:
df_new = df.dropna()
df_new

           day  temperature  windspeed  event
3   2025-01-04         30.0       10.0  sunny
5   2025-01-06         32.0        6.0  sunny
9   2025-01-10         33.0       20.0   snow
10  2025-01-11         18.0       20.0  sunny
11  2025-01-12         31.0        8.0   rain
12  2025-01-13         31.0       20.0  sunny
14  2025-01-15         23.0        6.0   rain
16  2025-01-17         30.0       22.0  sunny
19  2025-01-20         20.0       15.0   snow
20  2025-01-21         21.0       16.0   snow
21  2025-01-22         29.0       24.0   snow
25  2025-01-26         33.0       19.0   snow
26  2025-01-27         22.0       22.0   snow
27  2025-01-28         27.0       22.0   snow
28  2025-01-29         24.0       15.0   rain
29  2025-01-30         34.0       15.0   snow
32  2025-02-02         26.0       13.0  sunny
33  2025-02-03         20.0       14.0   rain
34  2025-02-04         33.0       15.0   snow
35  2025-02-05         18.0       23.0  sunny
38  2025-02-08         19.0        7.0   snow
39  2025-02-09         22.0       22.0   snow
42  2025-02-12         19.0       15.0   snow
43  2025-02-13         18.0       16.0   rain
45  2025-02-15         27.0       18.0  sunny
48  2025-02-18         27.0       15.0  sunny
49  2025-02-19         24.0       21.0   snow
51  2025-02-21         19.0       18.0  sunny
53  2025-02-23         33.0       21.0   snow
55  2025-02-25         27.0       18.0  sunny
57  2025-02-27         30.0       23.0   snow
58  2025-02-28         20.0       21.0   rain

In [42]:
df1 = df_new.pivot(index = "event",columns = "day")
df1

      temperature                                                         \
day    2025-01-04 2025-01-06 2025-01-10 2025-01-11 2025-01-12 2025-01-13
event
rain          NaN        NaN        NaN        NaN       31.0        NaN
snow          NaN        NaN       33.0        NaN        NaN        NaN
sunny        30.0       32.0        NaN       18.0        NaN       31.0

                                                   ...  windspeed             \
day   2025-01-15 2025-01-17 2025-01-20 2025-01-21  ... 2025-02-12 2025-02-13
event                                              ...
rain        23.0        NaN        NaN        NaN  ...        NaN       16.0
snow         NaN        NaN       20.0       21.0  ...       15.0        NaN
sunny        NaN       30.0        NaN        NaN  ...        NaN        NaN

                                                                         \
day   2025-02-15 2025-02-18 2025-02-19 2025-02-21 2025-02-23 2025-02-25
event
rain         NaN        NaN        NaN        NaN        NaN        NaN
snow         NaN        NaN       21.0        NaN       21.0        NaN
sunny       18.0       15.0        NaN       18.0        NaN       18.0


day   2025-02-27 2025-02-28
event
rain         NaN       21.0
snow        23.0        NaN
sunny        NaN        NaN

[3 rows x 64 columns]

In [43]:
#if only temperature want 
df1 = df_new.pivot(index = "event",columns = "day",values = "temperature")
df1

day,2025-01-04,2025-01-06,2025-01-10,2025-01-11,2025-01-12,2025-01-13,2025-01-15,2025-01-17,2025-01-20,2025-01-21,...,2025-02-12,2025-02-13,2025-02-15,2025-02-18,2025-02-19,2025-02-21,2025-02-23,2025-02-25,2025-02-27,2025-02-28
event,,,,,,,,,,,,,,,,,,,,,
rain,NaN,NaN,NaN,NaN,31.0,NaN,23.0,NaN,NaN,NaN,...,NaN,18.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20.0
snow,NaN,NaN,33.0,NaN,NaN,NaN,NaN,NaN,20.0,21.0,...,19.0,NaN,NaN,NaN,24.0,NaN,33.0,NaN,30.0,NaN
sunny,30.0,32.0,NaN,18.0,NaN,31.0,NaN,30.0,NaN,NaN,...,NaN,NaN,27.0,27.0,NaN,19.0,NaN,27.0,NaN,NaN

In [44]:
df

           day  temperature  windspeed  event
0   2025-01-01          NaN       12.0    NaN
1   2025-01-02         33.0        NaN   snow
2   2025-01-03         27.0        NaN    NaN
3   2025-01-04         30.0       10.0  sunny
4   2025-01-05          NaN        NaN   rain
..         ...          ...        ...    ...
56  2025-02-26         32.0        NaN   rain
57  2025-02-27         30.0       23.0   snow
58  2025-02-28         20.0       21.0   rain
59  2025-03-01          NaN        6.0   snow
60  2025-03-02         24.0        NaN  sunny

[61 rows x 4 columns]

In [45]:
df = pd.read_csv("data/weather_city_name.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

### **pivot table allows to resape or transform data**

In [47]:
df1 = df.pivot_table(index = "city",columns = "date")
### its automatically return the mean where the values are same 
df1

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [50]:
df1 = df.pivot_table(index = "city",columns = "date", aggfunc = "sum")
### return the sum of the values of same day
df1

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai        163      111         153      162
new york      110      122         126      142

In [51]:
df3 = pd.read_csv("data/weather_same_city.csv")
df3

          date      city  temperature  humidity
0   05/02/2017  new york           32        58
1   08/02/2017  new york           34        55
2   12/02/2017  new york           30        60
3   18/02/2017  new york           28        62
4   25/02/2017  new york           29        59
5   03/03/2017  new york           40        52
6   07/03/2017  new york           42        50
7   12/03/2017  new york           38        54
8   18/03/2017  new york           41        51
9   26/03/2017  new york           39        53
10  02/12/2017  new york           25        65
11  06/12/2017  new york           24        68
12  11/12/2017  new york           22        70
13  18/12/2017  new york           20        72
14  27/12/2017  new york           21        69

### want to print the avd of the feb , mar and dec month using grouper function

In [56]:
df3
df3['date'] = pd.to_datetime(df3['date'], dayfirst=True)
df3

         date      city  temperature  humidity
0  2017-02-05  new york           32        58
1  2017-02-08  new york           34        55
2  2017-02-12  new york           30        60
3  2017-02-18  new york           28        62
4  2017-02-25  new york           29        59
5  2017-03-03  new york           40        52
6  2017-03-07  new york           42        50
7  2017-03-12  new york           38        54
8  2017-03-18  new york           41        51
9  2017-03-26  new york           39        53
10 2017-12-02  new york           25        65
11 2017-12-06  new york           24        68
12 2017-12-11  new york           22        70
13 2017-12-18  new york           20        72
14 2017-12-27  new york           21        69

In [62]:
df2 = df3.pivot_table(index = pd.Grouper(key="date",freq="M"),columns = "city")
# M means the month , here in the data frame there are 3 months ... feb ,mar,dec ,,,grouper func will return the avg humidity and temp of feb,mar,dec 
df2

C:\Users\KIIT0001\AppData\Local\Temp\ipykernel_16408\1712762551.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df2 = df3.pivot_table(index = pd.Grouper(key="date",freq="M"),columns = "city")

           humidity temperature
city       new york    new york
date
2017-02-28     58.8        30.6
2017-03-31     52.0        40.0
2017-12-31     68.8        22.4